---
type: FBXExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FBXExportOptions

`Autodesk.Revit.DB.FBXExportOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FBXExportOptions | — | `public FBXExportOptions ()` |
| Property | LevelsOfDetailValue | 2013 | `public int LevelsOfDetailValue { get ; set ; }` |
| Property | StopOnError | — | `public bool StopOnError { get ; set ; }` |
| Property | UseLevelsOfDetail | 2013 | `public bool UseLevelsOfDetail { get ; set ; }` |
| Property | WithoutBoundaryEdges | 2013 | `public bool WithoutBoundaryEdges { get ; set ; }` |